In [157]:
import pandas as pd

In [158]:
df = pd.read_csv("sales_data.csv")

In [159]:
df.head()

,Product_ID,Sale_Date,Sales_Rep,Region,Sales_Amount,Quantity_Sold,Product_Category,Unit_Cost,Unit_Price,Customer_Type,Discount,Payment_Method,Sales_Channel,Region_and_Sales_Rep
0,1052,2023-02-03,Bob,North,5053.97,18,Furniture,152.75,267.22,Returning,0.09,Cash,Online,North-Bob
1,1093,2023-04-21,Bob,West,4384.02,17,Furniture,3816.39,4209.44,Returning,0.11,Cash,Retail,West-Bob
2,1015,2023-09-21,David,South,4631.23,30,Food,261.56,371.40,Returning,0.20,Bank Transfer,Retail,South-David
3,1072,2023-08-24,Bob,South,2167.94,39,Clothing,4330.03,4467.75,New,0.02,Credit Card,Retail,South-Bob
4,1061,2023-03-24,Charlie,East,3750.20,13,Electronics,637.37,692.71,New,0.08,Credit Card,Online,East-Charlie

In [160]:
df = df[['Sales_Amount' , 'Quantity_Sold' ]]

In [161]:
df = df.rename(columns={'Sales_Amount' : 'Amount' , 'Quantity_sold' : 'Quantity'})

In [162]:
df.head()

    Amount  Quantity_Sold
0  5053.97             18
1  4384.02             17
2  4631.23             30
3  2167.94             39
4  3750.20             13

In [163]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Amount         1000 non-null   float64
 1   Quantity_Sold  1000 non-null   int64
dtypes: float64(1), int64(1)
memory usage: 15.8 KB

In [164]:
import random
df['Discount'] = random.choices([0,5,10,15,20,25,30,35,40,45,50],weights=[10,10,10,10,10,1,1,1,1,10,10],k=1000)

In [165]:
df['Order_id']=range(1001,2001)

In [166]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Amount         1000 non-null   float64
 1   Quantity_Sold  1000 non-null   int64
 2   Discount       1000 non-null   int64
 3   Order_id       1000 non-null   int64
dtypes: float64(1), int64(3)
memory usage: 31.4 KB

In [167]:
df

      Amount  Quantity_Sold  Discount  Order_id
0    5053.97             18        45      1001
1    4384.02             17        45      1002
2    4631.23             30        20      1003
3    2167.94             39        20      1004
4    3750.20             13        15      1005
..       ...            ...       ...       ...
995  4733.88              4         0      1996
996  4716.36             37         5      1997
997  7629.70             17         5      1998
998  1629.47             39        20      1999
999  4923.93             48        20      2000

[1000 rows x 4 columns]

In [168]:
df = df.loc[:,['Order_id' , 'Amount' , 'Discount' , 'Quantity_Sold']]

In [169]:
df.head()

   Order_id   Amount  Discount  Quantity_Sold
0      1001  5053.97        45             18
1      1002  4384.02        45             17
2      1003  4631.23        20             30
3      1004  2167.94        20             39
4      1005  3750.20        15             13

In [170]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order_id       1000 non-null   int64
 1   Amount         1000 non-null   float64
 2   Discount       1000 non-null   int64
 3   Quantity_Sold  1000 non-null   int64
dtypes: float64(1), int64(3)
memory usage: 31.4 KB

In [171]:
rows=10000

new_df = pd.DataFrame({
    "Order_ID": range(2001, 2001 + rows),
    "Amount": random.choices(range(1000, 10000), k=rows),
    "Discount": random.choices(
        [0,5,10,15,20,25,30,35,40,45,50],
        weights=[10,10,10,10,10,1,1,1,1,10,10],
        k=rows
    ),
    "Quantity_Sold": random.choices(range(1, 100), k=rows)
})

In [172]:
new_df.tail()

      Order_ID  Amount  Discount  Quantity_Sold
9995     11996    7823        10              9
9996     11997    1503        20             91
9997     11998    7070        45             73
9998     11999    7196        20             11
9999     12000    3412        50             63

In [173]:
df.rename(columns={"Order_id": "Order_ID"}, inplace=True)

In [174]:
df = pd.concat([df,new_df],ignore_index = True)

In [175]:
df

       Order_ID   Amount  Discount  Quantity_Sold
0          1001  5053.97        45             18
1          1002  4384.02        45             17
2          1003  4631.23        20             30
3          1004  2167.94        20             39
4          1005  3750.20        15             13
...         ...      ...       ...            ...
10995     11996  7823.00        10              9
10996     11997  1503.00        20             91
10997     11998  7070.00        45             73
10998     11999  7196.00        20             11
10999     12000  3412.00        50             63

[11000 rows x 4 columns]

In [176]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11000 entries, 0 to 10999
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order_ID       11000 non-null  int64
 1   Amount         11000 non-null  float64
 2   Discount       11000 non-null  int64
 3   Quantity_Sold  11000 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 343.9 KB

In [177]:
df.tail()

       Order_ID  Amount  Discount  Quantity_Sold
10995     11996  7823.0        10              9
10996     11997  1503.0        20             91
10997     11998  7070.0        45             73
10998     11999  7196.0        20             11
10999     12000  3412.0        50             63

In [178]:
df.to_csv('sales.csv',index=False)